// Задание:
// Создайте приложение "Counter" - это счётчик, который содержит 
// блок результата и две кнопки, для увеличения числа счётчика на 
// 1 и для уменьшения числа счётчика на 1. Начальное значение - 0

// создайте компонент Counter в папке components
// в компоненте Counter должны быть 2 кнопки: "+" и "-"
// между кнопками должна быть область где будет расположена число 0
// (Которая затем будет увеличиваться по мере нажатия на кнопки)
// добавьте стилей по вашим вкусовым предпочтениям

// передайте компоненту Button пропсу onClick, эта пропса должна 
// принимать функцию передайте кнопкам "+" и "-" через пропсы функции, 
// которые должны выводить в консоль следующее: "Произошло увеличение на 1" 
// и "произошло уменьшение на 1" 
// соответственно создайте компонент Lesson_04, импортируйте компонент Counter туда 
// и отобразите компонент Counter по середине страницы Компонент Lesson_04 передайте 
// компоненту App и верните его из App, чтобы вы увидели изменения на странице

import Counter from "../../components/Counter/Counter.jsx";
import './Lesson_04.css';
import { useState } from "react";
function Lesson_04() {
    //let count = 0;
    //это старый вариант,при котором изменение видно только в консоле,а значение в окне не меняется,
    //метод старый,те актуальности данных нет(когда идет count--/++) 
    // const handlePlus = () => {
    //     count++;
    //     console.log("Произошло увеличение на 1",count);
    // };
    // const handleMinus = () => {
    //     count--;
    //     console.log("Произошло уменьшение на 1",count);
    // };
    //////////////////////////////////////////////
//Новый метод(основной),использует состояние ХУК(крючок),готовые функции в реакт.
//функция хук возвращает нам в переменную стейт массив из 2х элементов(андефайнд(состояние компонента) и ф-функция которая изменяет наше состояние)
//// Функция-хук useState возвращает нам в переменную state массив из 2 элементов:
  // 1 элемент массива state - это состояние, которое мы планируем изменять и показывать на экране(наш счетчик count)
  // 2 элемент массива - это функция, которая изменяет наше состояние(то есть 1 элемент массива)
  // Без деструктуризации
  // const state = useState();
  // console.log(state);
  // console.log(state[0]);
  // console.log(state[1]);
 
//     return (
//         <div className="Lesson_04_block">
//             <Counter
//             plusCount={handlePlus}
//             minusCount={handleMinus}
//             />
//         </div>
//     );
// }

// export default Lesson_04;

 //C деструктуризацией
  const [count, setCount] = useState(0);
  console.log(count)

  const handleMinus = () => { 
    setCount((preValue) => {
        return preValue -1;
    });};

  const handlePlus = () => {
    setCount((preValue) => {
        return preValue +1;
    });
  };
  return (
        <div className="Lesson_04_block">
            <Counter
            countValue={count}
            plusCount={handlePlus}
            minusCount={handleMinus}
            />
        </div>
    );
}

export default Lesson_04;
